<?php
/**
* 错误码辅助类
* @author      mozarlee
* @time        2017-03-07 09:01:50
* @created by  Sublime Text 3
*/
namespace App\Helpers;

class ErrorHelper
{
	private static $error = array(
		'100001' => '账户登录超时，请重新登录',
		'100002' =>  '参数缺失',
		'100003' => '请先登录',
        '100004' => '用户信息异常',
        '100005' => '卖方用户信息异常',

		'200001' => '保存失败，请重试',
		'200002' => '用户信息错误',
        '200003' => '请先实名认证',
        '200004' => '账户余额不足',
		'200005' => '可售数量不足',
        '200006' => '交易密码有误',
        '200007' => '更新用户余额失败',
        '200008' => '请先结算未完成的订单',
        '200009' => '不能购买自己发布的订单',
        '200011' => '只能购买可售的产品',
        '200012' => '卖家不存在',
        '200013' => '只能购买活动中的产品',
        '200014' => '对不起，当天购买已经超出限额！',
        '200015' => '活动尚未开始！',
		

		'300001' => '请填写正确的数量',
		'300002' => '请填写正确的出租时间',
		'300003' => '请先完成风险测评',
		'300004' => '生成订单失败',
		'300005' => '禁止提现',
		
		'400003' => '请先绑定银行卡',
		'400004' => '请先绑定币地址',
		'400005' => '还款失败',
		'400006' => '未到还款时间，不可还款!',
		
		'500003' => '请先设置交易密码',		
		'600001' => 'USER_NOT_LOGINED',
		'600002'=>'登录失败，用户名密码不匹配',
		'700001' => 'SIGN IS NULL',
		'800001' => '交易密码错误',
        '800003' => '禁止交易',
		'800004' => '转让已结束',
		'800005' => '产品已撤销',
		'800006' => '交易成功',
		'800007' => '交易失败',
		'800008' => '不能购买自己发布的产品',
		'1000' =>'成功'
		);

	/**
	 * 返回错误码及对应错误信息,错误码为0时返回正确结果
	 * @param  string $errorCode 错误码，错误码为0 表示处理正常 返回$msg
	 * @param string $msg 正确数据信息
	 * @return array
	 */
	public static function getErrorMsg( $errorCode = '', $msg = '' ){
		if( $msg == '0' ){
			//处理特殊情况msg为0时
			$data = array(
				'code' => $errorCode,
				'msg' => $msg,
				);
			return $data;
		}

		if( empty($msg) && ( $errorCode != '1000' ) ){
			$data = array(
				'code' => $errorCode,
				'msg' => self::$error[$errorCode],
				);
		}else{
			$data = array(
				'code' => $errorCode,
				'msg' => $msg,
				);
		}
		return $data;
	}

}